3D_Cylinder_Re3900/S/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         50.0;

deltaT          2.0e-3;

writeControl    timeStep;

writeInterval   5000;

purgeWrite      10;

writeFormat     binary;

writePrecision  20;

writeCompression off;

timeFormat      general;

timePrecision   20;

runTimeModifiable true;

pressArtDiff    false; //activate artificial diffusion on pressure
convArtDiff     false; //activate artificial diffusion on pressure

ducLevelPress       1.00;
ducLevelConv        1.00;
epsilon             4.0e-2;
kp                  0.25;//25;
ku                  0.75;//75;


libs (
         "libSmag.so"
         "libOpenFOAM.so"
         "libsampling.so"
     );

// ************************************************************************* //

