3D_Cylinder_Re3900/S/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    periodic_p
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          34000;
        startFace       3020000;
        matchTolerance  1e-05;
        transform       unknown;
        neighbourPatch  periodic_m;
    }
    Cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6000;
        startFace       3054000;
    }
    periodic_m
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          34000;
        startFace       3060000;
        matchTolerance  1e-05;
        transform       unknown;
        neighbourPatch  periodic_p;
    }
    Outlet
    {
        type            patch;
        nFaces          3000;
        startFace       3094000;
    }
    Inlet
    {
        type            patch;
        nFaces          3000;
        startFace       3097000;
    }
)

// ************************************************************************* //
