3D_Cylinder_Re3900/S/constant/spongeDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      indexDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Ls       15.0;   // sponge-layer length 
f        1.0;   // minimum frequency
a        1.0;   // free-stream speed of sound
M        0.2;   // Free-stream Mach number
LAD     0.75;   // Sponge Layer dimensionless length

//----------------------------------------------------------------------

gamma    1.4;  
pinf     1.0;
Tinf     1.0;

Uinf_x   0.2;
Uinf_y   0.0;
Uinf_z   0.0;
k	4.34294481903252e-01;


// *********************************************************************** //
