3D_Cylinder_Re3900/S/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.2 0 0);

boundaryField
{
    periodic_p
    {
        type            cyclic;
    }
    Cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    periodic_m
    {
        type            cyclic;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
