3D_Cylinder_Re3900/S/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{
    periodic_p
    {
        type            cyclic;
    }
    Cylinder
    {
        type            fixedValue;
        value           uniform 1;
    }
    periodic_m
    {
        type            cyclic;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
}


// ************************************************************************* //
